Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShort Property
 AdjustEdge is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdjustEdgeTooShort { get; }
Public Shared ReadOnly Property AdjustEdgeTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdjustEdgeTooShort {
	FailureDefinitionId^ get ();
}
static member AdjustEdgeTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace